/*******************************************************************************
** 文件名称：hal_timer3.h
** 文件作用：TIMER3
** 编写作者：Tom Free 付瑞彪
** 编写时间：2020-06-22
** 文件备注：
**			 
** 更新记录：
**          2020-06-22 -> 创建文件                             <Tom Free 付瑞彪>
**
**              Copyright (c) 2018-2020 付瑞彪 All Rights Reserved
**
**       1 Tab == 4 Spaces     UTF-8     ANSI C Language(C99)
*******************************************************************************/
#ifndef __HAL_TIMER3_H__
#define __HAL_TIMER3_H__

#include "gm_type.h"

/*******************************************************************************
** 函数名称：HAL_TIM3_Init
** 函数作用：通用定时器3中断初始化
** 输入参数：arr - 自动重装值。
**           psc - 时钟预分频数
** 输出参数：无
** 使用样例：HAL_TIM3_Init(4999,7199);
** 函数备注：这里时钟选择为APB1的2倍，而APB1为36M
*******************************************************************************/
void HAL_TIM3_Init(uint16_t arr, uint16_t psc, void(*hook)());

#endif  /* __HAL_TIMER3_H__ */
