/*******************************************************************************
** 文件名称：app_timer3.c
** 文件作用：定时器3应用层
** 编写作者：Tom Free 付瑞彪
** 编写时间：2020-06-22
** 文件备注：
**			 
** 更新记录：
**          2020-06-22 -> 创建文件                             <Tom Free 付瑞彪>
**
**              Copyright (c) 2018-2020 付瑞彪 All Rights Reserved
**
**       1 Tab == 4 Spaces     UTF-8     ANSI C Language(C99)
*******************************************************************************/

#include "app_timer3.h"
#include "hal_timer3.h"
#include "gm_timer.h"

/*******************************************************************************
** 函数名称：TIMER3_Init
** 函数作用：定时器初始化
** 输入参数：无
** 输出参数：无
** 使用样例：TIMER3_Init();
** 函数备注：
*******************************************************************************/
void TIMER3_Init(void)
{
    HAL_TIM3_Init(999, 71, GM_Timer_IncTicks);
}
