/*******************************************************************************
** 文件名称：app_led.h
** 文件作用：LED灯
** 编写作者：Tom Free 付瑞彪
** 编写时间：2020-06-21
** 文件备注：
**			 
** 更新记录：
**          2020-06-21 -> 创建文件                             <Tom Free 付瑞彪>
**
**              Copyright (c) 2018-2020 付瑞彪 All Rights Reserved
**
**       1 Tab == 4 Spaces     UTF-8     ANSI C Language(C99)
*******************************************************************************/
#ifndef __APP_LED_H__
#define __APP_LED_H__

#include "gm_type.h"

/*******************************************************************************
** 函数名称：LED_Init
** 函数作用：初始化LED
** 输入参数：
** 输出参数：
** 使用样例：LED_Init();
** 函数备注：
*******************************************************************************/
void LED_Init(void);

/*******************************************************************************
** 函数名称：LED_Control
** 函数作用：LED控制
** 输入参数：isOn - 是否点亮，GM_TRUE - 亮，GM_FALSE - 灭
** 输出参数：无
** 使用样例：LED_Control(GM_TRUE);
** 函数备注：
*******************************************************************************/
void LED_Control(GM_BOOL isOn);

/*******************************************************************************
** 函数名称：LED_Control_Fast
** 函数作用：LED快速控制，采用位带
** 输入参数：isOn - 是否点亮，GM_TRUE - 亮，GM_FALSE - 灭
** 输出参数：无
** 使用样例：LED_Control_Fast(GM_FALSE);
** 函数备注：
*******************************************************************************/
void LED_Control_Fast(GM_BOOL isOn);

/*******************************************************************************
** 函数名称：LED_Blink
** 函数作用：闪烁LED
** 输入参数：无
** 输出参数：无
** 使用样例：LED_Blink();
** 函数备注：
*******************************************************************************/
void LED_Blink(void);

#endif  /* __APP_LED_H__ */
