/*******************************************************************************
** 文件名称：gm_queue.h
** 文件作用：通用队列
** 编写作者：Tom Free 付瑞彪
** 编写时间：2020-02-29
** 文件备注：
**
** 更新记录：
**           2020-02-29 -> 创建文件
**                                                        -- Tom Free 付瑞彪
**
**
**              Copyright (c) 付瑞彪 All Rights Reserved
**
**       1 Tab == 4 Spaces     UTF-8     ANSI C Language(C99)
*******************************************************************************/
#ifndef __GM_QUEUE_H__
#define __GM_QUEUE_H__

/* 数据类型定义头文件 */
#include "../GM_Type/gm_type.h"

/* 队列定义，用于隐藏数据，防止用户过于关心内部数据结构 */
#define GM_QUEUE    void*

/*******************************************************************************
** 函数名称：GM_Queue_Create
** 函数作用：创建一个队列
** 输入参数：Capacity - 容量
**           DBSize   - 数据单元大小，即存放的单个数据所占字节数
** 输出参数：队列指针
** 使用范例：GM_QUEUE queue = GM_Queue_Create(10, sizeof(float));
** 函数备注：
*******************************************************************************/
GM_QUEUE GM_Queue_Create(GM_SIZE Capacity, GM_SIZE DBSize);

/*******************************************************************************
** 函数名称：GM_Queue_Delete
** 函数作用：删除队列
** 输入参数：queue - 队列句柄
** 输出参数：是否删除成功
** 使用范例：GM_BOOL res = GM_Queue_Delete(queue);
** 函数备注：
*******************************************************************************/
GM_BOOL GM_Queue_Delete(GM_QUEUE queue);

/*******************************************************************************
** 函数名称：GM_Queue_Read
** 函数作用：从队列中读取一个数据
** 输入参数：queue - 队列指针，pdata - 数据地址
** 输出参数：操作结果，GM_TRUE - 成功，GM_FALSE - 失败
** 使用范例：GM_BOOL res = GM_Queue_Read(&xQueue, &data);
** 函数备注：必须保证queue和pdata指针有效
*******************************************************************************/
GM_BOOL GM_Queue_Read(GM_QUEUE queue, void* pdata);

/*******************************************************************************
** 函数名称：GM_Queue_Write
** 函数作用：向队列中写入一个数据
** 输入参数：queue - 队列指针，data - 待写入数据
** 输出参数：操作结果，GM_TRUE - 成功，GM_FALSE - 失败
** 使用范例：GM_BOOL res = GM_Queue_Write(&xQueue, 0x88);
** 函数备注：必须保证queue指针有效
*******************************************************************************/
GM_BOOL GM_Queue_Write(GM_QUEUE queue, void* pdata);

/*******************************************************************************
** 函数名称：GM_Queue_Length
** 函数作用：获得队列中数据长度
** 输入参数：queue - 队列指针
** 输出参数：数据长度
** 使用范例：GM_U8 len = GM_Queue_Length(&xQueue);
** 函数备注：必须保证queue指针有效
*******************************************************************************/
GM_SIZE GM_Queue_Length(GM_QUEUE queue);

#endif  /* __GM_QUEUE_H__ */
